app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "done", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Deixar transparente"], ["done", nil], ["todo_id", 1], ["created_at", "2022-07-18 03:32:03.632116"], ["updated_at", "2022-07-18 03:32:03.632116"]]
---
    def create
        @task = Task.create(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "Deixar transparente ok"], ["updated_at", "2022-07-18 04:16:07.151167"], ["id", 1]]
---
    def update
        @task = Task.find(params[:id])
        @task.update(task_params)