app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    if params[:search]
      search_todo
    end
    @todos = Todo.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_id" = $1  [["todo_id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @task = Task.new
    @tasks = @todo.tasks
    @todo = Todo.find(params[:id])

SELECT "todos".* FROM "todos"
---
  def search_todo

    if @todo = Todo.all.find{|todo| todo.name.include?(params[:search])}

INSERT INTO "todos" ("name", "progress", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mudando a cor do fundo"], ["progress", nil], ["created_at", "2022-07-18 03:31:39.501869"], ["updated_at", "2022-07-18 03:31:39.501869"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
  def destroy
    @todo.destroy

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_todo
      @todo = Todo.find(params[:id])